In [1]:
import pandas as pd
import numpy as np

In [2]:
Cadastro_alunos = {
    'Alunos': ['Jorge','Thyale','Luiz','Carol'],
    'Nota1': [8,9,7,6]
}

In [3]:
df = pd.DataFrame(data=Cadastro_alunos)

In [4]:
df

   Alunos  Nota1
0   Jorge      8
1  Thyale      9
2    Luiz      7
3   Carol      6

In [5]:
df['Nota2']=[8,10,8,9]

In [6]:
df

   Alunos  Nota1  Nota2
0   Jorge      8      8
1  Thyale      9     10
2    Luiz      7      8
3   Carol      6      9

In [9]:
df['MédiaGeral'] = (df['Nota1'] + df['Nota2']) / 2

In [10]:
df

   Alunos  Nota1  Nota2  MédiaGeral
0   Jorge      8      8         8.0
1  Thyale      9     10         9.5
2    Luiz      7      8         7.5
3   Carol      6      9         7.5